{"config": [{"config": {"name": "cropping2d_1", "trainable": true, "input_dtype": "float32", "cropping": [[40, 14], [0, 0]], "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"name": "lambda_1", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s#\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000j\u0002\u0000j\u0003\u0000|\u0000\u0000d\u0005\u0000\u0083\u0002\u0000S)\u0006N\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0004Z\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0002\u00da\u0001xZ\u0003ktf\u00a9\u0000r\b\u0000\u0000\u0000\u00faV/home/adnguyen1989/Dropbox/SDC/behavioral-cloning/CarND-Behavioral-Cloning-P3/model.py\u00da\u0011_transform_resize)\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0010\u0001", null, null], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"name": "lambda_2", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faV/home/adnguyen1989/Dropbox/SDC/behavioral-cloning/CarND-Behavioral-Cloning-P3/model.py\u00da\u0011_transform_center-\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "bias": true, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 24, "nb_row": 5, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "bias": true, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 36, "nb_row": 5, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "bias": true, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 48, "nb_row": 5, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_4", "bias": true, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_5", "bias": true, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias": true, "input_dim": 1152, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias": true, "input_dim": 100, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias": true, "input_dim": 50, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 10, "activation": "relu", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_4", "bias": true, "input_dim": 10, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "activation": "linear", "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}